semihurtekin/c2000_motor_control/01_mcal/ti/f28379d/gpio/source/mcal_gpio.c
/*****************************************************************************/
/*                                                                           */
/*  File        : mcal_gpio.c                                                */
/*  Description : GPIO MCAL implementation                                   */
/*                                                                           */
/*  Scope                                                                    */
/*  -----                                                                    */
/*  - GPIO0 through GPIO168                                                  */
/*  - GPIO-function pin initialization                                       */
/*  - Direction, pull-up, open-drain and inversion                           */
/*  - Input qualification mode and shared qualification period               */
/*  - Digital GPIO/peripheral mux selection                                  */
/*  - CPU/CLA data-register ownership selection                              */
/*  - GPIO configuration lock, unlock and commit                             */
/*  - Atomic pin write and toggle                                            */
/*  - Pin read                                                               */
/*                                                                           */
/*  Analog/USB mode and public port-level data services are intentionally   */
/*  excluded from the motor-control GPIO v1.0 scope.                        */
/*                                                                           */
/*****************************************************************************/

#include "mcal_gpio.h"
#include "F2837xD_device.h"

#include <stddef.h>

/*****************************************************************************/
/* Local Constants                                                           */
/*****************************************************************************/

#define MCAL_GPIO_PORT_SIZE    (32U)
#define MCAL_GPIO_MUX_SIZE     (16U)
#define MCAL_GPIO_CSEL_SIZE    (8U)
#define MCAL_GPIO_QUAL_SIZE    (8U)
#define MCAL_GPIO_MAX_PIN      ((Mcal_GpioPinType)168U)
#define MCAL_GPIO_MAX_MUX      ((Mcal_GpioMuxType)15U)
#define MCAL_GPIO_MAX_DIV      (510U)
#define MCAL_GPIO_2BIT_MASK    ((uint32_t)0x3U)
#define MCAL_GPIO_4BIT_MASK    ((uint32_t)0xFU)
#define MCAL_GPIO_8BIT_MASK    ((uint32_t)0xFFU)

/*****************************************************************************/
/* Local Function Declarations                                               */
/*****************************************************************************/

static Mcal_GpioStatusType IsPinValid(
    Mcal_GpioPinType pin);

static Mcal_GpioStatusType IsLevelValid(
    Mcal_GpioLevelType level);

static Mcal_GpioStatusType IsDividerValid(
    uint16_t divider);

static Mcal_GpioStatusType CheckPinAccess(
    Mcal_GpioPinType pin);

static Mcal_GpioStatusType CheckQualAccess(
    Mcal_GpioPinType pin);

static Mcal_GpioStatusType ValidateConfig(
    const Mcal_GpioConfigType * config);

static uint16_t GetPortIndex(
    Mcal_GpioPinType pin);

static uint16_t GetBitIndex(
    Mcal_GpioPinType pin);

static uint32_t GetPinMask(
    Mcal_GpioPinType pin);

static volatile uint32_t * GetDirReg(
    uint16_t portIndex);

static volatile uint32_t * GetPudReg(
    uint16_t portIndex);

static volatile uint32_t * GetInvReg(
    uint16_t portIndex);

static volatile uint32_t * GetOdrReg(
    uint16_t portIndex);

static volatile uint32_t * GetCtrlReg(
    uint16_t portIndex);

static volatile uint32_t * GetQselReg(
    uint16_t portIndex,
    uint16_t regIndex);

static volatile uint32_t * GetMuxReg(
    uint16_t portIndex,
    uint16_t regIndex);

static volatile uint32_t * GetGmuxReg(
    uint16_t portIndex,
    uint16_t regIndex);

static volatile uint32_t * GetCselReg(
    uint16_t portIndex,
    uint16_t regIndex);

static volatile uint32_t * GetLockReg(
    uint16_t portIndex);

static volatile uint32_t * GetCommitReg(
    uint16_t portIndex);

static void WriteBit(
    volatile uint32_t * regPtr,
    uint16_t bitIndex,
    uint16_t bitValue);

static void Write2Bit(
    volatile uint32_t * regPtr,
    uint16_t fieldIndex,
    uint16_t fieldValue);

static void Write4Bit(
    volatile uint32_t * regPtr,
    uint16_t fieldIndex,
    uint16_t fieldValue);

static void Write8Bit(
    volatile uint32_t * regPtr,
    uint16_t fieldIndex,
    uint16_t fieldValue);

static Mcal_GpioStatusType SetDirection(
    Mcal_GpioPinType pin,
    Mcal_GpioDirType dir);

static Mcal_GpioStatusType SetPull(
    Mcal_GpioPinType pin,
    Mcal_GpioPullType pull);

static Mcal_GpioStatusType SetOpenDrain(
    Mcal_GpioPinType pin,
    Mcal_GpioOdrType odr);

static Mcal_GpioStatusType SetInvert(
    Mcal_GpioPinType pin,
    Mcal_GpioInvType inv);

static Mcal_GpioStatusType SetQual(
    Mcal_GpioPinType pin,
    Mcal_GpioQualType qual);

static Mcal_GpioStatusType SetOwner(
    Mcal_GpioPinType pin,
    Mcal_GpioOwnerType owner);

static Mcal_GpioStatusType SetPinMux(
    Mcal_GpioPinType pin,
    Mcal_GpioMuxType mux);

static Mcal_GpioStatusType SetQualPeriod(
    Mcal_GpioPinType pin,
    uint16_t divider);

static void WriteSet(
    uint16_t portIndex,
    uint32_t pinMask);

static void WriteClear(
    uint16_t portIndex,
    uint32_t pinMask);

static void WriteToggle(
    uint16_t portIndex,
    uint32_t pinMask);

static uint32_t ReadPort(
    uint16_t portIndex);

/*****************************************************************************/
/* Local Function Definitions                                                */
/*****************************************************************************/

/**
 * @brief Checks whether a GPIO pin number is supported.
 */
static Mcal_GpioStatusType IsPinValid(
    Mcal_GpioPinType pin)
{
    Mcal_GpioStatusType status;

    if (pin <= MCAL_GPIO_MAX_PIN)
    {
        status = MCAL_GPIO_STATUS_OK;
    }
    else
    {
        status = MCAL_GPIO_STATUS_INV_PIN;
    }

