semihurtekin/c2000_motor_control/01_mcal/ti/f28379d/gpio/source/mcal_gpio.c
    return status;
}

/**
 * @brief Checks whether a GPIO level value is valid.
 */
static Mcal_GpioStatusType IsLevelValid(
    Mcal_GpioLevelType level)
{
    Mcal_GpioStatusType status;

    if ((level == MCAL_GPIO_LEVEL_LOW) ||
        (level == MCAL_GPIO_LEVEL_HIGH))
    {
        status = MCAL_GPIO_STATUS_OK;
    }
    else
    {
        status = MCAL_GPIO_STATUS_INV_ARG;
    }

    return status;
}

/**
 * @brief Checks whether a qualification divider is supported.
 */
static Mcal_GpioStatusType IsDividerValid(
    uint16_t divider)
{
    Mcal_GpioStatusType status;

    if ((divider == 1U) ||
        (((divider >= 2U) && (divider <= MCAL_GPIO_MAX_DIV)) &&
         ((divider % 2U) == 0U)))
    {
        status = MCAL_GPIO_STATUS_OK;
    }
    else
    {
        status = MCAL_GPIO_STATUS_INV_ARG;
    }

    return status;
}

/**
 * @brief Checks whether one pin configuration can be modified.
 */
static Mcal_GpioStatusType CheckPinAccess(
    Mcal_GpioPinType pin)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * lockReg;
    volatile uint32_t * commitReg;
    uint16_t portIndex;
    uint32_t pinMask;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        pinMask = GetPinMask(pin);
        lockReg = GetLockReg(portIndex);
        commitReg = GetCommitReg(portIndex);

        if ((lockReg == NULL) || (commitReg == NULL))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }
        else if ((*commitReg & pinMask) != 0U)
        {
            status = MCAL_GPIO_STATUS_COMMITTED;
        }
        else if ((*lockReg & pinMask) != 0U)
        {
            status = MCAL_GPIO_STATUS_LOCKED;
        }
        else
        {
            /* Configuration access is available. */
        }
    }

    return status;
}

/**
 * @brief Checks access to one shared qualification-period group.
 */
static Mcal_GpioStatusType CheckQualAccess(
    Mcal_GpioPinType pin)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * lockReg;
    volatile uint32_t * commitReg;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t groupBase;
    uint32_t groupMask;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        bitIndex = GetBitIndex(pin);
        groupBase = (uint16_t)((bitIndex / MCAL_GPIO_QUAL_SIZE) *
                               MCAL_GPIO_QUAL_SIZE);
        groupMask = ((uint32_t)0xFFU << groupBase);
        lockReg = GetLockReg(portIndex);
        commitReg = GetCommitReg(portIndex);

        if ((lockReg == NULL) || (commitReg == NULL))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }
        else if ((*commitReg & groupMask) != 0U)
        {
            status = MCAL_GPIO_STATUS_COMMITTED;
        }
        else if ((*lockReg & groupMask) != 0U)
        {
            status = MCAL_GPIO_STATUS_LOCKED;
        }
        else
        {
            /* Shared qualification configuration is available. */
        }
    }

    return status;
}

/**
 * @brief Validates a complete GPIO pin configuration.
 */
static Mcal_GpioStatusType ValidateConfig(
    const Mcal_GpioConfigType * config)
{
    Mcal_GpioStatusType status;

    status = MCAL_GPIO_STATUS_OK;

    if (config == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_ARG;
    }
    else
    {
        status = IsPinValid(config->pin);

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->dir != MCAL_GPIO_DIR_INPUT) &&
            (config->dir != MCAL_GPIO_DIR_OUTPUT))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->pull != MCAL_GPIO_PULL_DISABLE) &&
            (config->pull != MCAL_GPIO_PULL_ENABLE))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->odr != MCAL_GPIO_ODR_DISABLE) &&
            (config->odr != MCAL_GPIO_ODR_ENABLE))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->inv != MCAL_GPIO_INV_DISABLE) &&
            (config->inv != MCAL_GPIO_INV_ENABLE))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->qual != MCAL_GPIO_QUAL_SYNC) &&
            (config->qual != MCAL_GPIO_QUAL_3SAMPLE) &&
            (config->qual != MCAL_GPIO_QUAL_6SAMPLE) &&
            (config->qual != MCAL_GPIO_QUAL_ASYNC))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->owner != MCAL_GPIO_OWNER_CPU1) &&
            (config->owner != MCAL_GPIO_OWNER_CPU1_CLA1) &&
            (config->owner != MCAL_GPIO_OWNER_CPU2) &&
            (config->owner != MCAL_GPIO_OWNER_CPU2_CLA1))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }

        if (status == MCAL_GPIO_STATUS_OK)
        {
            status = IsLevelValid(config->initLevel);
        }

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->dir == MCAL_GPIO_DIR_INPUT) &&
            (config->odr == MCAL_GPIO_ODR_ENABLE))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->dir == MCAL_GPIO_DIR_OUTPUT) &&
            (config->owner != MCAL_GPIO_OWNER_CPU1))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }
    }

    return status;
}

/**
 * @brief Calculates the GPIO port index.
 */
static uint16_t GetPortIndex(
    Mcal_GpioPinType pin)
{
    return (uint16_t)(pin / MCAL_GPIO_PORT_SIZE);
}

/**
 * @brief Calculates the bit index inside a GPIO port.
 */
static uint16_t GetBitIndex(
    Mcal_GpioPinType pin)
{
    return (uint16_t)(pin % MCAL_GPIO_PORT_SIZE);
}

/**
 * @brief Calculates the 32-bit mask for a GPIO pin.
 */
static uint32_t GetPinMask(
    Mcal_GpioPinType pin)
{
    uint16_t bitIndex;
    uint32_t pinMask;

    bitIndex = GetBitIndex(pin);
    pinMask = ((uint32_t)1U << bitIndex);

    return pinMask;
}

/**
 * @brief Resolves the direction register of a GPIO port.
 */
static volatile uint32_t * GetDirReg(
    uint16_t portIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = &GpioCtrlRegs.GPADIR.all;
            break;
        case 1U:
            regPtr = &GpioCtrlRegs.GPBDIR.all;
            break;
        case 2U:
            regPtr = &GpioCtrlRegs.GPCDIR.all;
            break;
        case 3U:
            regPtr = &GpioCtrlRegs.GPDDIR.all;
            break;
        case 4U:
            regPtr = &GpioCtrlRegs.GPEDIR.all;
            break;
        case 5U:
            regPtr = &GpioCtrlRegs.GPFDIR.all;
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves the pull-up disable register of a GPIO port.
 */
static volatile uint32_t * GetPudReg(
    uint16_t portIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = &GpioCtrlRegs.GPAPUD.all;
            break;
        case 1U:
            regPtr = &GpioCtrlRegs.GPBPUD.all;
            break;
        case 2U:
            regPtr = &GpioCtrlRegs.GPCPUD.all;
            break;
        case 3U:
            regPtr = &GpioCtrlRegs.GPDPUD.all;
            break;
        case 4U:
            regPtr = &GpioCtrlRegs.GPEPUD.all;
            break;
        case 5U:
            regPtr = &GpioCtrlRegs.GPFPUD.all;
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves the input inversion register of a GPIO port.
 */
static volatile uint32_t * GetInvReg(
    uint16_t portIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = &GpioCtrlRegs.GPAINV.all;
            break;
        case 1U:
            regPtr = &GpioCtrlRegs.GPBINV.all;
            break;
        case 2U:
            regPtr = &GpioCtrlRegs.GPCINV.all;
            break;
        case 3U:
            regPtr = &GpioCtrlRegs.GPDINV.all;
            break;
        case 4U:
            regPtr = &GpioCtrlRegs.GPEINV.all;
            break;
        case 5U:
            regPtr = &GpioCtrlRegs.GPFINV.all;
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves the open-drain register of a GPIO port.
 */
static volatile uint32_t * GetOdrReg(
    uint16_t portIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = &GpioCtrlRegs.GPAODR.all;
            break;
        case 1U:
            regPtr = &GpioCtrlRegs.GPBODR.all;
            break;
        case 2U:
            regPtr = &GpioCtrlRegs.GPCODR.all;
            break;
        case 3U:
            regPtr = &GpioCtrlRegs.GPDODR.all;
            break;
        case 4U:
            regPtr = &GpioCtrlRegs.GPEODR.all;
            break;
        case 5U:
            regPtr = &GpioCtrlRegs.GPFODR.all;
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves the qualification control register of a GPIO port.
 */
static volatile uint32_t * GetCtrlReg(
    uint16_t portIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U: regPtr = &GpioCtrlRegs.GPACTRL.all; break;
        case 1U: regPtr = &GpioCtrlRegs.GPBCTRL.all; break;
        case 2U: regPtr = &GpioCtrlRegs.GPCCTRL.all; break;
        case 3U: regPtr = &GpioCtrlRegs.GPDCTRL.all; break;
        case 4U: regPtr = &GpioCtrlRegs.GPECTRL.all; break;
        case 5U: regPtr = &GpioCtrlRegs.GPFCTRL.all; break;
        default: break;
    }

    return regPtr;
}

/**
 * @brief Resolves one 2-bit qualification register.
 */
static volatile uint32_t * GetQselReg(
    uint16_t portIndex,
    uint16_t regIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPAQSEL1.all :
                                       &GpioCtrlRegs.GPAQSEL2.all;
            break;
        case 1U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPBQSEL1.all :
                                       &GpioCtrlRegs.GPBQSEL2.all;
            break;
        case 2U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPCQSEL1.all :
                                       &GpioCtrlRegs.GPCQSEL2.all;
            break;
        case 3U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPDQSEL1.all :
                                       &GpioCtrlRegs.GPDQSEL2.all;
            break;
        case 4U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPEQSEL1.all :
                                       &GpioCtrlRegs.GPEQSEL2.all;
            break;
        case 5U:
            if (regIndex == 0U)
            {
                regPtr = &GpioCtrlRegs.GPFQSEL1.all;
            }
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves one 2-bit peripheral mux register.
 */
static volatile uint32_t * GetMuxReg(
    uint16_t portIndex,
    uint16_t regIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPAMUX1.all :
                                       &GpioCtrlRegs.GPAMUX2.all;
            break;
        case 1U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPBMUX1.all :
                                       &GpioCtrlRegs.GPBMUX2.all;
            break;
        case 2U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPCMUX1.all :
                                       &GpioCtrlRegs.GPCMUX2.all;
            break;
        case 3U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPDMUX1.all :
                                       &GpioCtrlRegs.GPDMUX2.all;
            break;
        case 4U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPEMUX1.all :
                                       &GpioCtrlRegs.GPEMUX2.all;
            break;
        case 5U:
            if (regIndex == 0U)
            {
                regPtr = &GpioCtrlRegs.GPFMUX1.all;
            }
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves one 2-bit group mux register.
 */
static volatile uint32_t * GetGmuxReg(
    uint16_t portIndex,
    uint16_t regIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPAGMUX1.all :
                                       &GpioCtrlRegs.GPAGMUX2.all;
            break;
        case 1U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPBGMUX1.all :
                                       &GpioCtrlRegs.GPBGMUX2.all;
            break;
        case 2U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPCGMUX1.all :
                                       &GpioCtrlRegs.GPCGMUX2.all;
            break;
        case 3U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPDGMUX1.all :
                                       &GpioCtrlRegs.GPDGMUX2.all;
            break;
        case 4U:
            regPtr = (regIndex == 0U) ? &GpioCtrlRegs.GPEGMUX1.all :
                                       &GpioCtrlRegs.GPEGMUX2.all;
            break;
        case 5U:
            if (regIndex == 0U)
            {
                regPtr = &GpioCtrlRegs.GPFGMUX1.all;
            }
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves one 4-bit controller select register.
 */
static volatile uint32_t * GetCselReg(
    uint16_t portIndex,
    uint16_t regIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            switch (regIndex)
            {
                case 0U: regPtr = &GpioCtrlRegs.GPACSEL1.all; break;
                case 1U: regPtr = &GpioCtrlRegs.GPACSEL2.all; break;
                case 2U: regPtr = &GpioCtrlRegs.GPACSEL3.all; break;
                case 3U: regPtr = &GpioCtrlRegs.GPACSEL4.all; break;
                default: break;
            }
            break;
        case 1U:
            switch (regIndex)
            {
                case 0U: regPtr = &GpioCtrlRegs.GPBCSEL1.all; break;
                case 1U: regPtr = &GpioCtrlRegs.GPBCSEL2.all; break;
                case 2U: regPtr = &GpioCtrlRegs.GPBCSEL3.all; break;
                case 3U: regPtr = &GpioCtrlRegs.GPBCSEL4.all; break;
                default: break;
            }
            break;
        case 2U:
            switch (regIndex)
            {
                case 0U: regPtr = &GpioCtrlRegs.GPCCSEL1.all; break;
                case 1U: regPtr = &GpioCtrlRegs.GPCCSEL2.all; break;
                case 2U: regPtr = &GpioCtrlRegs.GPCCSEL3.all; break;
                case 3U: regPtr = &GpioCtrlRegs.GPCCSEL4.all; break;
                default: break;
            }
            break;
        case 3U:
            switch (regIndex)
            {
                case 0U: regPtr = &GpioCtrlRegs.GPDCSEL1.all; break;
                case 1U: regPtr = &GpioCtrlRegs.GPDCSEL2.all; break;
                case 2U: regPtr = &GpioCtrlRegs.GPDCSEL3.all; break;
                case 3U: regPtr = &GpioCtrlRegs.GPDCSEL4.all; break;
                default: break;
            }
            break;
        case 4U:
            switch (regIndex)
            {
                case 0U: regPtr = &GpioCtrlRegs.GPECSEL1.all; break;
                case 1U: regPtr = &GpioCtrlRegs.GPECSEL2.all; break;
                case 2U: regPtr = &GpioCtrlRegs.GPECSEL3.all; break;
                case 3U: regPtr = &GpioCtrlRegs.GPECSEL4.all; break;
                default: break;
            }
            break;
        case 5U:
            switch (regIndex)
            {
                case 0U: regPtr = &GpioCtrlRegs.GPFCSEL1.all; break;
                case 1U: regPtr = &GpioCtrlRegs.GPFCSEL2.all; break;
                default: break;
            }
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves the configuration lock register of one GPIO port.
 */
static volatile uint32_t * GetLockReg(
    uint16_t portIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = &GpioCtrlRegs.GPALOCK.all;
            break;
        case 1U:
            regPtr = &GpioCtrlRegs.GPBLOCK.all;
            break;
        case 2U:
            regPtr = &GpioCtrlRegs.GPCLOCK.all;
            break;
        case 3U:
            regPtr = &GpioCtrlRegs.GPDLOCK.all;
            break;
        case 4U:
            regPtr = &GpioCtrlRegs.GPELOCK.all;
            break;
        case 5U:
            regPtr = &GpioCtrlRegs.GPFLOCK.all;
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Resolves the lock commit register of one GPIO port.
 */
static volatile uint32_t * GetCommitReg(
    uint16_t portIndex)
{
    volatile uint32_t * regPtr;

    regPtr = NULL;

    switch (portIndex)
    {
        case 0U:
            regPtr = &GpioCtrlRegs.GPACR.all;
            break;
        case 1U:
            regPtr = &GpioCtrlRegs.GPBCR.all;
            break;
        case 2U:
            regPtr = &GpioCtrlRegs.GPCCR.all;
            break;
        case 3U:
            regPtr = &GpioCtrlRegs.GPDCR.all;
            break;
        case 4U:
            regPtr = &GpioCtrlRegs.GPECR.all;
            break;
        case 5U:
            regPtr = &GpioCtrlRegs.GPFCR.all;
            break;
        default:
            break;
    }

    return regPtr;
}

/**
 * @brief Updates one 1-bit field in a control register.
 */
static void WriteBit(
    volatile uint32_t * regPtr,
    uint16_t bitIndex,
    uint16_t bitValue)
{
    uint32_t regValue;
    uint32_t bitMask;

