semihurtekin/c2000_motor_control/01_mcal/ti/f28379d/gpio/source/mcal_gpio.c
    regValue = *regPtr;
    bitMask = ((uint32_t)1U << bitIndex);

    if (bitValue != 0U)
    {
        regValue |= bitMask;
    }
    else
    {
        regValue &= ~bitMask;
    }

    *regPtr = regValue;
}

/**
 * @brief Updates one 2-bit field in a control register.
 */
static void Write2Bit(
    volatile uint32_t * regPtr,
    uint16_t fieldIndex,
    uint16_t fieldValue)
{
    uint16_t shift;
    uint32_t regValue;
    uint32_t fieldMask;
    uint32_t newValue;

    shift = (uint16_t)(fieldIndex * 2U);
    fieldMask = (MCAL_GPIO_2BIT_MASK << shift);
    newValue = ((uint32_t)fieldValue << shift);

    regValue = *regPtr;
    regValue &= ~fieldMask;
    regValue |= (newValue & fieldMask);
    *regPtr = regValue;
}

/**
 * @brief Updates one 4-bit field in a control register.
 */
static void Write4Bit(
    volatile uint32_t * regPtr,
    uint16_t fieldIndex,
    uint16_t fieldValue)
{
    uint16_t shift;
    uint32_t regValue;
    uint32_t fieldMask;
    uint32_t newValue;

    shift = (uint16_t)(fieldIndex * 4U);
    fieldMask = (MCAL_GPIO_4BIT_MASK << shift);
    newValue = ((uint32_t)fieldValue << shift);

    regValue = *regPtr;
    regValue &= ~fieldMask;
    regValue |= (newValue & fieldMask);
    *regPtr = regValue;
}

/**
 * @brief Updates one 8-bit field in a control register.
 */
static void Write8Bit(
    volatile uint32_t * regPtr,
    uint16_t fieldIndex,
    uint16_t fieldValue)
{
    uint16_t shift;
    uint32_t regValue;
    uint32_t fieldMask;
    uint32_t newValue;

    shift = (uint16_t)(fieldIndex * 8U);
    fieldMask = (MCAL_GPIO_8BIT_MASK << shift);
    newValue = ((uint32_t)fieldValue << shift);

    regValue = *regPtr;
    regValue &= ~fieldMask;
    regValue |= (newValue & fieldMask);
    *regPtr = regValue;
}

/**
 * @brief Configures the direction bit of one GPIO pin.
 */
static Mcal_GpioStatusType SetDirection(
    Mcal_GpioPinType pin,
    Mcal_GpioDirType dir)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * regPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t bitValue;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    regPtr = GetDirReg(portIndex);

    if (regPtr == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        bitValue = (dir == MCAL_GPIO_DIR_OUTPUT) ? 1U : 0U;
        WriteBit(regPtr, bitIndex, bitValue);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Configures the internal pull-up of one GPIO pin.
 */
static Mcal_GpioStatusType SetPull(
    Mcal_GpioPinType pin,
    Mcal_GpioPullType pull)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * regPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t bitValue;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    regPtr = GetPudReg(portIndex);

    if (regPtr == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        bitValue = (pull == MCAL_GPIO_PULL_ENABLE) ? 0U : 1U;
        WriteBit(regPtr, bitIndex, bitValue);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Configures native open-drain mode of one GPIO pin.
 */
static Mcal_GpioStatusType SetOpenDrain(
    Mcal_GpioPinType pin,
    Mcal_GpioOdrType odr)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * regPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t bitValue;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    regPtr = GetOdrReg(portIndex);

    if (regPtr == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        bitValue = (odr == MCAL_GPIO_ODR_ENABLE) ? 1U : 0U;
        WriteBit(regPtr, bitIndex, bitValue);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Configures input inversion of one GPIO pin.
 */
static Mcal_GpioStatusType SetInvert(
    Mcal_GpioPinType pin,
    Mcal_GpioInvType inv)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * regPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t bitValue;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    regPtr = GetInvReg(portIndex);

    if (regPtr == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        bitValue = (inv == MCAL_GPIO_INV_ENABLE) ? 1U : 0U;
        WriteBit(regPtr, bitIndex, bitValue);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Configures input qualification mode of one GPIO pin.
 */
static Mcal_GpioStatusType SetQual(
    Mcal_GpioPinType pin,
    Mcal_GpioQualType qual)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * regPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t regIndex;
    uint16_t fieldIndex;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    regIndex = (uint16_t)(bitIndex / MCAL_GPIO_MUX_SIZE);
    fieldIndex = (uint16_t)(bitIndex % MCAL_GPIO_MUX_SIZE);
    regPtr = GetQselReg(portIndex, regIndex);

    if (regPtr == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        Write2Bit(regPtr, fieldIndex, (uint16_t)qual);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Configures the GPIO data-register controller selection.
 */
static Mcal_GpioStatusType SetOwner(
    Mcal_GpioPinType pin,
    Mcal_GpioOwnerType owner)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * regPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t regIndex;
    uint16_t fieldIndex;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    regIndex = (uint16_t)(bitIndex / MCAL_GPIO_CSEL_SIZE);
    fieldIndex = (uint16_t)(bitIndex % MCAL_GPIO_CSEL_SIZE);
    regPtr = GetCselReg(portIndex, regIndex);

    if (regPtr == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        Write4Bit(regPtr, fieldIndex, (uint16_t)owner);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Selects the digital function in the MUX and GMUX registers.
 */
static Mcal_GpioStatusType SetPinMux(
    Mcal_GpioPinType pin,
    Mcal_GpioMuxType mux)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * muxPtr;
    volatile uint32_t * gmuxPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t regIndex;
    uint16_t fieldIndex;
    uint16_t muxValue;
    uint16_t gmuxValue;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    regIndex = (uint16_t)(bitIndex / MCAL_GPIO_MUX_SIZE);
    fieldIndex = (uint16_t)(bitIndex % MCAL_GPIO_MUX_SIZE);
    muxPtr = GetMuxReg(portIndex, regIndex);
    gmuxPtr = GetGmuxReg(portIndex, regIndex);

    if ((muxPtr == NULL) || (gmuxPtr == NULL))
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        muxValue = (uint16_t)(mux & 0x3U);
        gmuxValue = (uint16_t)((mux >> 2U) & 0x3U);

