semihurtekin/c2000_motor_control/01_mcal/ti/f28379d/gpio/source/mcal_gpio.c
        /* Force MUX to GPIO-safe value before changing GMUX. */
        Write2Bit(muxPtr, fieldIndex, 0U);
        Write2Bit(gmuxPtr, fieldIndex, gmuxValue);
        Write2Bit(muxPtr, fieldIndex, muxValue);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Configures one shared eight-pin qualification period.
 */
static Mcal_GpioStatusType SetQualPeriod(
    Mcal_GpioPinType pin,
    uint16_t divider)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * regPtr;
    uint16_t portIndex;
    uint16_t bitIndex;
    uint16_t fieldIndex;
    uint16_t fieldValue;

    portIndex = GetPortIndex(pin);
    bitIndex = GetBitIndex(pin);
    fieldIndex = (uint16_t)(bitIndex / MCAL_GPIO_QUAL_SIZE);
    regPtr = GetCtrlReg(portIndex);

    if (regPtr == NULL)
    {
        status = MCAL_GPIO_STATUS_INV_CFG;
    }
    else
    {
        fieldValue = (uint16_t)(divider / 2U);
        Write8Bit(regPtr, fieldIndex, fieldValue);
        status = MCAL_GPIO_STATUS_OK;
    }

    return status;
}

/**
 * @brief Sets selected GPIO bits in a port.
 */
static void WriteSet(
    uint16_t portIndex,
    uint32_t pinMask)
{
    switch (portIndex)
    {
        case 0U:
            GpioDataRegs.GPASET.all = pinMask;
            break;
        case 1U:
            GpioDataRegs.GPBSET.all = pinMask;
            break;
        case 2U:
            GpioDataRegs.GPCSET.all = pinMask;
            break;
        case 3U:
            GpioDataRegs.GPDSET.all = pinMask;
            break;
        case 4U:
            GpioDataRegs.GPESET.all = pinMask;
            break;
        case 5U:
            GpioDataRegs.GPFSET.all = pinMask;
            break;
        default:
            break;
    }
}

/**
 * @brief Clears selected GPIO bits in a port.
 */
static void WriteClear(
    uint16_t portIndex,
    uint32_t pinMask)
{
    switch (portIndex)
    {
        case 0U:
            GpioDataRegs.GPACLEAR.all = pinMask;
            break;
        case 1U:
            GpioDataRegs.GPBCLEAR.all = pinMask;
            break;
        case 2U:
            GpioDataRegs.GPCCLEAR.all = pinMask;
            break;
        case 3U:
            GpioDataRegs.GPDCLEAR.all = pinMask;
            break;
        case 4U:
            GpioDataRegs.GPECLEAR.all = pinMask;
            break;
        case 5U:
            GpioDataRegs.GPFCLEAR.all = pinMask;
            break;
        default:
            break;
    }
}

/**
 * @brief Toggles selected GPIO bits in a port.
 */
static void WriteToggle(
    uint16_t portIndex,
    uint32_t pinMask)
{
    switch (portIndex)
    {
        case 0U:
            GpioDataRegs.GPATOGGLE.all = pinMask;
            break;
        case 1U:
            GpioDataRegs.GPBTOGGLE.all = pinMask;
            break;
        case 2U:
            GpioDataRegs.GPCTOGGLE.all = pinMask;
            break;
        case 3U:
            GpioDataRegs.GPDTOGGLE.all = pinMask;
            break;
        case 4U:
            GpioDataRegs.GPETOGGLE.all = pinMask;
            break;
        case 5U:
            GpioDataRegs.GPFTOGGLE.all = pinMask;
            break;
        default:
            break;
    }
}

/**
 * @brief Reads the complete GPIO data register of a port.
 */
static uint32_t ReadPort(
    uint16_t portIndex)
{
    uint32_t portValue;

    portValue = 0U;

    switch (portIndex)
    {
        case 0U:
            portValue = GpioDataRegs.GPADAT.all;
            break;
        case 1U:
            portValue = GpioDataRegs.GPBDAT.all;
            break;
        case 2U:
            portValue = GpioDataRegs.GPCDAT.all;
            break;
        case 3U:
            portValue = GpioDataRegs.GPDDAT.all;
            break;
        case 4U:
            portValue = GpioDataRegs.GPEDAT.all;
            break;
        case 5U:
            portValue = GpioDataRegs.GPFDAT.all;
            break;
        default:
            break;
    }

    return portValue;
}

/*****************************************************************************/
/* Public Function Definitions                                               */
/*****************************************************************************/

/**
 * @brief Initializes one pin for GPIO operation.
 */
Mcal_GpioStatusType Mcal_Gpio_InitPin(
    const Mcal_GpioConfigType * config)
{
    Mcal_GpioStatusType status;
    uint16_t portIndex;
    uint32_t pinMask;

    status = ValidateConfig(config);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        status = CheckPinAccess(config->pin);
    }

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(config->pin);
        pinMask = GetPinMask(config->pin);

        EALLOW;

        status = SetDirection(config->pin, MCAL_GPIO_DIR_INPUT);

        if (status == MCAL_GPIO_STATUS_OK)
        {
            status = SetPinMux(config->pin, (Mcal_GpioMuxType)0U);
        }

        if (status == MCAL_GPIO_STATUS_OK)
        {
            status = SetPull(config->pin, config->pull);
        }

        if (status == MCAL_GPIO_STATUS_OK)
        {
            status = SetOpenDrain(config->pin, config->odr);
        }

        if (status == MCAL_GPIO_STATUS_OK)
        {
            status = SetInvert(config->pin, config->inv);
        }

        if (status == MCAL_GPIO_STATUS_OK)
        {
            status = SetQual(config->pin, config->qual);
        }

        if (status == MCAL_GPIO_STATUS_OK)
        {
            status = SetOwner(config->pin, config->owner);
        }

        EDIS;

        if ((status == MCAL_GPIO_STATUS_OK) &&
            (config->dir == MCAL_GPIO_DIR_OUTPUT))
        {
            if (config->initLevel == MCAL_GPIO_LEVEL_HIGH)
            {
                WriteSet(portIndex, pinMask);
            }
            else
            {
                WriteClear(portIndex, pinMask);
            }

            EALLOW;
            status = SetDirection(config->pin, MCAL_GPIO_DIR_OUTPUT);
            EDIS;
        }
    }

    return status;
}

/**
 * @brief Sets the qualification sampling period for one eight-pin group.
 */
Mcal_GpioStatusType Mcal_Gpio_SetQualPeriod(
    Mcal_GpioPinType pin,
    uint16_t divider)
{
    Mcal_GpioStatusType status;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        status = IsDividerValid(divider);
    }

    if (status == MCAL_GPIO_STATUS_OK)
    {
        status = CheckQualAccess(pin);
    }

    if (status == MCAL_GPIO_STATUS_OK)
    {
        EALLOW;
        status = SetQualPeriod(pin, divider);
        EDIS;
    }

