semihurtekin/c2000_motor_control/01_mcal/ti/f28379d/gpio/source/mcal_gpio.c
    return status;
}

/**
 * @brief Selects the digital alternate function of one GPIO pin.
 */
Mcal_GpioStatusType Mcal_Gpio_SetMux(
    Mcal_GpioPinType pin,
    Mcal_GpioMuxType mux)
{
    Mcal_GpioStatusType status;

    status = IsPinValid(pin);

    if ((status == MCAL_GPIO_STATUS_OK) &&
        (mux > MCAL_GPIO_MAX_MUX))
    {
        status = MCAL_GPIO_STATUS_INV_ARG;
    }

    if (status == MCAL_GPIO_STATUS_OK)
    {
        status = CheckPinAccess(pin);
    }

    if (status == MCAL_GPIO_STATUS_OK)
    {
        EALLOW;
        status = SetPinMux(pin, mux);
        EDIS;
    }

    return status;
}

/**
 * @brief Locks the configuration of one GPIO pin.
 */
Mcal_GpioStatusType Mcal_Gpio_Lock(
    Mcal_GpioPinType pin)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * lockReg;
    volatile uint32_t * commitReg;
    uint16_t portIndex;
    uint32_t pinMask;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        pinMask = GetPinMask(pin);
        lockReg = GetLockReg(portIndex);
        commitReg = GetCommitReg(portIndex);

        if ((lockReg == NULL) || (commitReg == NULL))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }
        else if ((*commitReg & pinMask) != 0U)
        {
            status = MCAL_GPIO_STATUS_COMMITTED;
        }
        else
        {
            EALLOW;
            *lockReg |= pinMask;
            EDIS;
        }
    }

    return status;
}

/**
 * @brief Unlocks the configuration of one GPIO pin.
 */
Mcal_GpioStatusType Mcal_Gpio_Unlock(
    Mcal_GpioPinType pin)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * lockReg;
    volatile uint32_t * commitReg;
    uint16_t portIndex;
    uint32_t pinMask;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        pinMask = GetPinMask(pin);
        lockReg = GetLockReg(portIndex);
        commitReg = GetCommitReg(portIndex);

        if ((lockReg == NULL) || (commitReg == NULL))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }
        else if ((*commitReg & pinMask) != 0U)
        {
            status = MCAL_GPIO_STATUS_COMMITTED;
        }
        else
        {
            EALLOW;
            *lockReg &= ~pinMask;
            EDIS;
        }
    }

    return status;
}

/**
 * @brief Locks and commits the configuration of one GPIO pin.
 */
Mcal_GpioStatusType Mcal_Gpio_CommitLock(
    Mcal_GpioPinType pin)
{
    Mcal_GpioStatusType status;
    volatile uint32_t * lockReg;
    volatile uint32_t * commitReg;
    uint16_t portIndex;
    uint32_t pinMask;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        pinMask = GetPinMask(pin);
        lockReg = GetLockReg(portIndex);
        commitReg = GetCommitReg(portIndex);

        if ((lockReg == NULL) || (commitReg == NULL))
        {
            status = MCAL_GPIO_STATUS_INV_CFG;
        }
        else if ((*commitReg & pinMask) != 0U)
        {
            status = MCAL_GPIO_STATUS_COMMITTED;
        }
        else
        {
            EALLOW;
            *lockReg |= pinMask;
            *commitReg |= pinMask;
            EDIS;

            if (((*lockReg & pinMask) == 0U) ||
                ((*commitReg & pinMask) == 0U))
            {
                status = MCAL_GPIO_STATUS_INV_CFG;
            }
        }
    }

    return status;
}

/**
 * @brief Writes a logical level to a GPIO pin.
 */
Mcal_GpioStatusType Mcal_Gpio_Write(
    Mcal_GpioPinType pin,
    Mcal_GpioLevelType level)
{
    Mcal_GpioStatusType status;
    uint16_t portIndex;
    uint32_t pinMask;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        status = IsLevelValid(level);
    }

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        pinMask = GetPinMask(pin);

        if (level == MCAL_GPIO_LEVEL_HIGH)
        {
            WriteSet(portIndex, pinMask);
        }
        else
        {
            WriteClear(portIndex, pinMask);
        }
    }

    return status;
}

/**
 * @brief Toggles a GPIO pin using the hardware toggle register.
 */
Mcal_GpioStatusType Mcal_Gpio_Toggle(
    Mcal_GpioPinType pin)
{
    Mcal_GpioStatusType status;
    uint16_t portIndex;
    uint32_t pinMask;

    status = IsPinValid(pin);

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        pinMask = GetPinMask(pin);
        WriteToggle(portIndex, pinMask);
    }

    return status;
}

/**
 * @brief Reads the logical level of a GPIO pin.
 */
Mcal_GpioStatusType Mcal_Gpio_Read(
    Mcal_GpioPinType pin,
    Mcal_GpioLevelType * levelPtr)
{
    Mcal_GpioStatusType status;
    uint16_t portIndex;
    uint32_t pinMask;
    uint32_t portValue;

    status = IsPinValid(pin);

    if ((status == MCAL_GPIO_STATUS_OK) &&
        (levelPtr == NULL))
    {
        status = MCAL_GPIO_STATUS_INV_ARG;
    }

    if (status == MCAL_GPIO_STATUS_OK)
    {
        portIndex = GetPortIndex(pin);
        pinMask = GetPinMask(pin);
        portValue = ReadPort(portIndex);

        if ((portValue & pinMask) != 0U)
        {
            *levelPtr = MCAL_GPIO_LEVEL_HIGH;
        }
        else
        {
            *levelPtr = MCAL_GPIO_LEVEL_LOW;
        }
    }

    return status;
}
